from aiogram import Bot, Dispatcher, F
from aiogram.types import Message, CallbackQuery
from aiogram.filters import CommandStart
from aiogram.utils.keyboard import InlineKeyboardBuilder
import asyncio

TOKEN = "8914757601:AAHSiSctSckCWCggDqtbjb-zxIGr5n1BWU8"

bot = Bot(token=TOKEN)
dp = Dispatcher()

# Таблица допусков
TOLERANCES = {
    (1, 3): {"A1/H6":(6,0),
        "Г1/n5":(8,4),
        "T1/m5":(6,2),
        "H1/k5":(4,0),
        "П1/Js5":(2,-2),
        "C1=B1/h5":(0,-4),
        "D1/g5":(-2,-6),
        "Х1/f6":(-6,-12),
        "A/H7":(10,0),
        "Г/n6":(10,4),
        "T/m6":(8,2),
        "H/k6":(6,0),
        "П/Js6":(3,-3),
        "C=B/h6": (0, -6),
        "D/g6": (-2, -8),
        "X/f7":(-6,-16),
        "Л/е8":(-14,-28),
        "Ш/d8":(-20,-34),
        "TX/c8":(-60,-74),
        "A2a/H8":(14,0),
        "Г2а/n7":(14,4),
        "T2a/m7":(0,0),
        "H2a/k7":(10,0),
        "П2а/js7":(5,-5),
        "C2a/h7":(0,-10),
        "X2a/f8":(-6,-20),
        "A3/H9":(25,0),
        "C3/h8":(0,-14),
        "X3/f9":(-6,-31),
        "Ш3/d9":(-20,-45),
        "A3a/H10":(40,0),
        "C3a/h10":(0,-40),
        "A4/H11":(60,0),
        "C4/h11":(0,-60),
        "X4/d11":(-20,-80),
        "Л4/b11":(-140,-200),
        "Ш4/d11":(-270,-330),
        "A5/H12":(100,0),
        "C5=B5/h12":(0,-100),
        "X5/b12":(-140,-240),
        "A/H7": (0, 10),
        "Гр/u7": (28,18),
        "Пр/s6":(20,14),
        "Пр/r6":(16,10),
    },

    (3, 6): {
        "A1/H6":(8,0),
        "Г1/n5":(13,8),
        "T1/m5":(9,4),
        "H1/k5":(6,1),
        "П1/Js5":(2.5,-2.5),
        "C1=B1/h5":(0,-5),
        "D1/g5":(-4,-9),
        "Х1/f6":(-10,-18),
        "A/H7":(12,0),
        "Г/n6":(16,8),
        "T/m6":(12,4),
        "H/k6":(9,1),
        "П/Js6":(4,-4),
        "C=B/h6": (0, -8),
        "D/g6": (-4, -12),
        "X/f7":(-10,-22),
        "Л/е8":(-20,-38),
        "Ш/d8":(-30,-48),
        "TX/c8":(-70,-88),
        "A2a/H8":(18,0),
        "Г2а/n7":(20,8),
        "T2a/m7":(16,4),
        "H2a/k7":(13,1),
        "П2а/js7":(6,-6),
        "C2a/h7":(0,-12),
        "X2a/f8":(-10,-28),
        "A3/H9":(30,0),
        "C3/h8":(0,-18),
        "X3/f9":(-10,-40),
        "Ш3/d9":(-30,-60),
        "A3a/H10":(48,0),
        "C3a/h10":(0,-48),
        "A4/H11":(75,0),
        "C4/h11":(0,-75),
        "X4/d11":(-30,-105),
        "Л4/b11":(-140,-215),
        "Ш4/d11":(-270,-345),
        "A5/H12":(120,0),
        "C5=B5/h12":(0,-120),
        "X5/b12":(-140,-260),
        "A/H7": (0, 12),
        "Гр/u7": (35,23),
        "Пр/s6":(27,19),
        "Пр/r6":(23,15),
    },

    (6, 10): {
        "A1/H6":(9,0),
        "Г1/n5":(16,10),
        "T1/m5":(12,6),
        "H1/k5":(7,1),
        "П1/Js5":(3,-3),
        "C1=B1/h5":(0,-6),
        "D1/g5":(-5,-11),
        "Х1/f6":(-13,-22),
        "A/H7":(15,0),
        "Г/n6":(19,10),
        "T/m6":(15,6),
        "H/k6":(10,1),
        "П/Js6":(4.5,-4.5),
        "C=B/h6": (0, -9),
        "D/g6": (-5,-14),
        "X/f7":(-13,-28),
        "Л/е8":(-25,-47),
        "Ш/d8":(-40,-62),
        "TX/c8":(-80,-102),
        "A2a/H8":(22,0),
        "Г2а/n7":(25,10),
        "T2a/m7":(21,6),
        "H2a/k7":(16,1),
        "П2а/js7":(7,-7),
        "C2a/h7":(0,-15),
        "X2a/f8":(-13,-35),
        "A3/H9":(36,0),
        "C3/h8":(0,-22),
        "X3/f9":(-13,-49),
        "Ш3/d9":(-40,-76),
        "A3a/H10":(58,0),
        "C3a/h10":(0,-58),
        "A4/H11":(90,0),
        "C4/h11":(0,-90),
        "X4/d11":(-40,-130),
        "Л4/b11":(-150,-240),
        "Ш4/d11":(-280,-370),
        "A5/H12":(150,0),
        "C5=B5/h12":(0,-150),
        "X5/b12":(-150,-300),
        "A/H7": (0, 15),
        "Гр/u7": (43,28),
        "Пр/s6":(32,23),
        "Пр/r6":(28,19),
    },
    (10, 18): {
        "A1/H6":(11,0),
        "Г1/n5":(20,12),
        "T1/m5":(15,7),
        "H1/k5":(9,1),
        "П1/Js5":(4,-4),
        "C1=B1/h5":(0,-8),
        "D1/g5":(-6,-14),
        "Х1/f6":(-16,-27),
        "A/H7":(18,0),
        "Г/n6":(23,12),
        "T/m6":(18,7),
        "H/k6":(12,1),
        "П/Js6":(5.5,-5.5),
        "C=B/h6": (0, -11),
        "D/g6": (-6,-17),
        "X/f7":(-16,-34),
        "Л/е8":(-32,-59),
        "Ш/d8":(-50,-77),
        "TX/c8":(-95,-122),
        "A2a/H8":(27,0),
        "Г2а/n7":(30,12),
        "T2a/m7":(25,7),
        "H2a/k7":(19,1),
        "П2а/js7":(9,-9),
        "C2a/h7":(0,-18),
        "X2a/f8":(-16,-43),
        "A3/H9":(43,0),
        "C3/h8":(0,-27),
        "X3/f9":(-16,-59),
        "Ш3/d9":(-50,-93),
        "A3a/H10":(70,0),
        "C3a/h10":(0,-70),
        "A4/H11":(110,0),
        "C4/h11":(0,-110),
        "X4/d11":(-50,-160),
        "Л4/b11":(-150,-260),
        "Ш4/d11":(-290,-400),
        "A5/H12":(180,0),
        "C5=B5/h12":(0,-180),
        "X5/b12":(-150,-330),
        "A/H7": (0, 18),
        "Гр/u7": (51,33),
        "Пр/s6":(39,28),
        "Пр/r6":(34,23),
    },
    (18, 24): {
        "A1/H6":(13,0),
        "Г1/n5":(24,15),
        "T1/m5":(17,8),
        "H1/k5":(11,2),
        "П1/Js5":(4.5,-4.5),
        "C1=B1/h5":(0,-9),
        "D1/g5":(-7,-16),
        "Х1/f6":(-20,-33),
        "A/H7":(21,0),
        "Г/n6":(28,15),
        "T/m6":(21,8),
        "H/k6":(15,2),
        "П/Js6":(6.5,-6.5),
        "C=B/h6": (0, -13),
        "D/g6": (-7,-20),
        "X/f7":(-20,-41),
        "Л/е8":(-40,-73),
        "Ш/d8":(-65,-98),
        "TX/c8":(-110,-143),
        "A2a/H8":(33,0),
        "Г2а/n7":(36,15),
        "T2a/m7":(29,8),
        "H2a/k7":(23,2),
        "П2а/js7":(10,-10),
        "C2a/h7":(0,-21),
        "X2a/f8":(-20,-53),
        "A3/H9":(52,0),
        "C3/h8":(0,-33),
        "X3/f9":(-20,-72),
        "Ш3/d9":(-65,-117),
        "A3a/H10":(84,0),
        "C3a/h10":(0,-84),
        "A4/H11":(130,0),
        "C4/h11":(0,-130),
        "X4/d11":(-65,-195),
        "Л4/b11":(-160,-290),
        "Ш4/d11":(-300,-430),
        "A5/H12":(210,0),
        "C5=B5/h12":(0,-210),
        "X5/b12":(-160,-370),
        "A/H7": (0, 21),
        "Гр/u7": (62,41),
        "Пр/s6":(48,35),
        "Пр/r6":(41,28),
    },
    (24, 30): {
        "A1/H6":(13,0),
        "Г1/n5":(24,15),
        "T1/m5":(17,8),
        "H1/k5":(11,2),
        "П1/Js5":(4.5,-4.5),
        "C1=B1/h5":(0,-9),
        "D1/g5":(-7,-16),
        "Х1/f6":(-20,-33),
        "A/H7":(21,0),
        "Г/n6":(28,15),
        "T/m6":(21,8),
        "H/k6":(15,2),
        "П/Js6":(6.5,-6.5),
        "C=B/h6": (0, -13),
        "D/g6": (-7,-20),
        "X/f7":(-20,-41),
        "Л/е8":(-40,-73),
        "Ш/d8":(-65,-98),
        "TX/c8":(-110,-143),
        "A2a/H8":(33,0),
        "Г2а/n7":(36,15),
        "T2a/m7":(29,8),
        "H2a/k7":(23,2),
        "П2а/js7":(10,-10),
        "C2a/h7":(0,-21),
        "X2a/f8":(-20,-53),
        "A3/H9":(52,0),
        "C3/h8":(0,-33),
        "X3/f9":(-20,-72),
        "Ш3/d9":(-65,-117),
        "A3a/H10":(84,0),
        "C3a/h10":(0,-84),
        "A4/H11":(130,0),
        "C4/h11":(0,-130),
        "X4/d11":(-65,-195),
        "Л4/b11":(-160,-290),
        "Ш4/d11":(-300,-430),
        "A5/H12":(210,0),
        "C5=B5/h12":(0,-210),
        "X5/b12":(-160,-370),
        "A/H7": (0, 21),
        "Гр/u7": (69,48),
        "Пр/s6":(48,35),
        "Пр/r6":(41,28),
    },
    (30,40): {
        "A1/H6":(16,0),
        "Г1/n5":(28,17),
        "T1/m5":(20,9),
        "H1/k5":(13,2),
        "П1/Js5":(5.5,-5.5),
        "C1=B1/h5":(0,-11),
        "D1/g5":(-9,-20),
        "Х1/f6":(-25,-41),
        "A/H7":(25,0),
        "Г/n6":(33,17),
        "T/m6":(25,9),
        "H/k6":(18,2),
        "П/Js6":(8,-8),
        "C=B/h6": (0, -16),
        "D/g6": (-9,-25),
        "X/f7":(-25,-50),
        "Л/е8":(-50,-89),
        "Ш/d8":(-80,-119),
        "TX/c8":(-120,-159),
        "A2a/H8":(39,0),
        "Г2а/n7":(42,17),
        "T2a/m7":(34,9),
        "H2a/k7":(27,2),
        "П2а/js7":(12,-12),
        "C2a/h7":(0,-25),
        "X2a/f8":(-25,-64),
        "A3/H9":(62,0),
        "C3/h8":(0,-39),
        "X3/f9":(-25,-87),
        "Ш3/d9":(-80,-142),
        "A3a/H10":(100,0),
        "C3a/h10":(0,-100),
        "A4/H11":(160,0),
        "C4/h11":(0,-160),
        "X4/d11":(-80,-240),
        "Л4/b11":(-170,-330),
        "Ш4/d11":(-310,-470),
        "A5/H12":(250,0),
        "C5=B5/h12":(0,-250),
        "X5/b12":(-170,-420),
        "A/H7": (0, 25),
        "Гр/u7": (85,60),
        "Пр/s6":(59,43),
        "Пр/r6":(50,34),
    },
    (40,50): {
        "A1/H6":(16,0),
        "Г1/n5":(28,17),
        "T1/m5":(20,9),
        "H1/k5":(13,2),
        "П1/Js5":(5.5,-5.5),
        "C1=B1/h5":(0,-11),
        "D1/g5":(-9,-20),
        "Х1/f6":(-25,-41),
        "A/H7":(25,0),
        "Г/n6":(33,17),
        "T/m6":(25,9),
        "H/k6":(18,2),
        "П/Js6":(8,-8),
        "C=B/h6": (0, -16),
        "D/g6": (-9,-25),
        "X/f7":(-25,-50),
        "Л/е8":(-50,-89),
        "Ш/d8":(-80,-119),
        "TX/c8":(-130,-169),
        "A2a/H8":(39,0),
        "Г2а/n7":(42,17),
        "T2a/m7":(34,9),
        "H2a/k7":(27,2),
        "П2а/js7":(12,-12),
        "C2a/h7":(0,-25),
        "X2a/f8":(-25,-64),
        "A3/H9":(62,0),
        "C3/h8":(0,-39),
        "X3/f9":(-25,-87),
        "Ш3/d9":(-80,-142),
        "A3a/H10":(100,0),
        "C3a/h10":(0,-100),
        "A4/H11":(160,0),
        "C4/h11":(0,-160),
        "X4/d11":(-80,-240),
        "Л4/b11":(-180,-340),
        "Ш4/d11":(-320,-480),
        "A5/H12":(250,0),
        "C5=B5/h12":(0,-250),
        "X5/b12":(-180,-430),
        "A/H7": (0, 25),
        "Гр/u7": (95,70),
        "Пр/s6":(59,43),
        "Пр/r6":(50,34),
    },
    (50,65): {
        "A1/H6":(19,0),
        "Г1/n5":(33,20),
        "T1/m5":(24,11),
        "H1/k5":(15,2),
        "П1/Js5":(6.5,-6.5),
        "C1=B1/h5":(0,-13),
        "D1/g5":(-10,-23),
        "Х1/f6":(-30,-49),
        "A/H7":(30,0),
        "Г/n6":(39,20),
        "T/m6":(30,11),
        "H/k6":(21,2),
        "П/Js6":(9.5,-9.5),
        "C=B/h6": (0, -19),
        "D/g6": (-10,-29),
        "X/f7":(-30,-60),
        "Л/е8":(-60,-106),
        "Ш/d8":(-110,-146),
        "TX/c8":(-140,-186),
        "A2a/H8":(46,0),
        "Г2а/n7":(50,20),
        "T2a/m7":(41,11),
        "H2a/k7":(32,2),
        "П2а/js7":(15,-15),
        "C2a/h7":(0,-30),
        "X2a/f8":(-30,-76),
        "A3/H9":(74,0),
        "C3/h8":(0,-46),
        "X3/f9":(-30,-104),
        "Ш3/d9":(-100,-174),
        "A3a/H10":(120,0),
        "C3a/h10":(0,-120),
        "A4/H11":(190,0),
        "C4/h11":(0,-190),
        "X4/d11":(-100,-290),
        "Л4/b11":(-190,-380),
        "Ш4/d11":(-340,-530),
        "A5/H12":(300,0),
        "C5=B5/h12":(0,-300),
        "X5/b12":(-190,-490),
        "A/H7": (0, 30),
        "Гр/u7": (117,87),
        "Пр/s6":(72,53),
        "Пр/r6":(60,41),
    },
    (65,80): {
        "A1/H6":(19,0),
        "Г1/n5":(33,20),
        "T1/m5":(24,11),
        "H1/k5":(15,2),
        "П1/Js5":(6.5,-6.5),
        "C1=B1/h5":(0,-13),
        "D1/g5":(-10,-23),
        "Х1/f6":(-30,-49),
        "A/H7":(30,0),
        "Г/n6":(39,20),
        "T/m6":(30,11),
        "H/k6":(21,2),
        "П/Js6":(9.5,-9.5),
        "C=B/h6": (0, -19),
        "D/g6": (-10,-29),
        "X/f7":(-30,-60),
        "Л/е8":(-60,-106),
        "Ш/d8":(-110,-146),
        "TX/c8":(-150,-196),
        "A2a/H8":(46,0),
        "Г2а/n7":(50,20),
        "T2a/m7":(41,11),
        "H2a/k7":(32,2),
        "П2а/js7":(15,-15),
        "C2a/h7":(0,-30),
        "X2a/f8":(-30,-76),
        "A3/H9":(74,0),
        "C3/h8":(0,-46),
        "X3/f9":(-30,-104),
        "Ш3/d9":(-100,-174),
        "A3a/H10":(120,0),
        "C3a/h10":(0,-120),
        "A4/H11":(190,0),
        "C4/h11":(0,-190),
        "X4/d11":(-100,-290),
        "Л4/b11":(-200,-390),
        "Ш4/d11":(-360,-550),
        "A5/H12":(300,0),
        "C5=B5/h12":(0,-300),
        "X5/b12":(-200,-500),
        "A/H7": (0, 30),
        "Гр/u7": (132,102),
        "Пр/s6":(72,53),
        "Пр/r6":(60,41),
    },
    (80,100): {
        "A1/H6":(22,0),
        "Г1/n5":(38,23),
        "T1/m5":(28,13),
        "H1/k5":(18,3),
        "П1/Js5":(7.5,-7.5),
        "C1=B1/h5":(0,-15),
        "D1/g5":(-12,-27),
        "Х1/f6":(-36,-58),
        "A/H7":(35,0),
        "Г/n6":(45,23),
        "T/m6":(35,13),
        "H/k6":(25,3),
        "П/Js6":(11,-11),
        "C=B/h6": (0, -22),
        "D/g6": (-12,-34),
        "X/f7":(-36,-71),
        "Л/е8":(-72,-126),
        "Ш/d8":(-120,-174),
        "TX/c8":(-170,-224),
        "A2a/H8":(54,0),
        "Г2а/n7":(58,23),
        "T2a/m7":(48,13),
        "H2a/k7":(38,3),
        "П2а/js7":(17,-17),
        "C2a/h7":(0,-35),
        "X2a/f8":(-36,-90),
        "A3/H9":(87,0),
        "C3/h8":(0,-54),
        "X3/f9":(-36,-123),
        "Ш3/d9":(-120,-207),
        "A3a/H10":(140,0),
        "C3a/h10":(0,-140),
        "A4/H11":(220,0),
        "C4/h11":(0,-220),
        "X4/d11":(-120,-340),
        "Л4/b11":(-220,-440),
        "Ш4/d11":(-380,-600),
        "A5/H12":(350,0),
        "C5=B5/h12":(0,-350),
        "X5/b12":(-220,-570),
        "A/H7": (0, 35),
        "Гр/u7": (159,124),
        "Пр/s6":(93,71),
        "Пр/r6":(73,51),
    },
    (100,120): {
        "A1/H6":(22,0),
        "Г1/n5":(38,23),
        "T1/m5":(28,13),
        "H1/k5":(18,3),
        "П1/Js5":(7.5,-7.5),
        "C1=B1/h5":(0,-15),
        "D1/g5":(-12,-27),
        "Х1/f6":(-36,-58),
        "A/H7":(35,0),
        "Г/n6":(45,23),
        "T/m6":(35,13),
        "H/k6":(25,3),
        "П/Js6":(11,-11),
        "C=B/h6": (0, -22),
        "D/g6": (-12,-34),
        "X/f7":(-36,-71),
        "Л/е8":(-72,-126),
        "Ш/d8":(-120,-174),
        "TX/c8":(-180,-234),
        "A2a/H8":(54,0),
        "Г2а/n7":(58,23),
        "T2a/m7":(48,13),
        "H2a/k7":(38,3),
        "П2а/js7":(17,-17),
        "C2a/h7":(0,-35),
        "X2a/f8":(-36,-90),
        "A3/H9":(87,0),
        "C3/h8":(0,-54),
        "X3/f9":(-36,-123),
        "Ш3/d9":(-120,-207),
        "A3a/H10":(140,0),
        "C3a/h10":(0,-140),
        "A4/H11":(220,0),
        "C4/h11":(0,-220),
        "X4/d11":(-120,-340),
        "Л4/b11":(-240,-460),
        "Ш4/d11":(-410,-630),
        "A5/H12":(350,0),
        "C5=B5/h12":(0,-350),
        "X5/b12":(-240,-590),
        "A/H7": (0, 35),
        "Гр/u7": (179,144),
        "Пр/s6":(101,79),
        "Пр/r6":(76,54),
    },
}

user_data = {}


def find_tolerance(diameter, field):
    for (d_min, d_max), values in TOLERANCES.items():
        if d_min <= diameter <= d_max:
            if field in values:
                return values[field]
    return None


def main_keyboard():
    builder = InlineKeyboardBuilder()

    builder.button(text="Ввести диаметр", callback_data="diameter")
    builder.button(text="Выбрать допуск", callback_data="field")
    builder.button(text="Рассчитать", callback_data="calc"),
    builder.button(text="Очиститт", callback_data="clear")

    builder.adjust(1)

    return builder.as_markup()

@dp.callback_query(F.data == "clear")
async def clear(callback: CallbackQuery):

    if callback.from_user.id in user_data:
        del user_data[callback.from_user.id]

    await callback.message.answer(
        "Данные очищены",
        reply_markup=main_menu()
    )

    await callback.answer( 
                reply_markup=main_keyboard())

@dp.message(CommandStart())
async def start(message: Message):
    await message.answer(
        "Бот допусков и посадок"
        "1. Введите диаметр"
        "2. Выберите поле допуска"
        "3. Нажмите 'Рассчитать'"
        "4.Очистить страницу",
        reply_markup=main_keyboard()
    )


@dp.callback_query(F.data == "diameter")
async def diameter_button(callback: CallbackQuery):
    user_data[callback.from_user.id] = {
        "mode": "wait_diameter"
    }

    await callback.message.answer("Введите диаметр в мм")
    await callback.answer()


@dp.callback_query(F.data == "field")
async def field_button(callback: CallbackQuery):
    builder = InlineKeyboardBuilder()

    fields = [
        "A1/H6",
        "Г1/n5",
        "T1/m5",
        "H1/k5",
        "П1/Js5",
        "C1=B1/h5",
        "D1/g5",
        "Х1/f6",
        "A/H7",
        "Г/n6",
        "T/m6",
        "H/k6",
        "П/Js6",
        "C=B/h6",
        "D/g6",
        "X/f7",
        "Л/е8",
        "Ш/d8",
        "TX/c8",
        "A2a/H8",
        "Г2а/n7",
        "T2a/m7",
        "H2a/k7",
        "П2а/js7",
        "C2a/h7",
        "X2a/f8",
        "A3/H9",
        "C3/h8",
        "X3/f9",
        "Ш3/d9",
        "A3a/H10",
        "C3a/h10",
        "A4/H11",
        "C4/h11",
        "X4/d11",
        "Л4/b11",
        "Ш4/d11",
        "A5/H12",
        "C5=B5/h12",
        "X5/b12",
        "A/H7",
        "Гр/u7",
        "Пр/s6",
        "Пр/r6"]

    for field in fields:
        builder.button(text=field, callback_data=f"field_{field}")

    builder.adjust(2)

    await callback.message.answer(
        "Выберите поле допуска",
        reply_markup=builder.as_markup()
    )

    await callback.answer( )
    
    

@dp.callback_query(F.data.startswith("field_"))
async def field_selected(callback: CallbackQuery):
    field = callback.data.replace("field_", "")

    if callback.from_user.id not in user_data:
        user_data[callback.from_user.id] = {}

    user_data[callback.from_user.id]["field"] = field

    await callback.message.answer(f"Выбран допуск: {field}",reply_markup=main_keyboard())
    await callback.answer(f"Квалитет определён: {field} мм",
                reply_markup=main_keyboard())


@dp.callback_query(F.data == "calc")
async def calculate(callback: CallbackQuery):
    data = user_data.get(callback.from_user.id)

    if not data:
        await callback.message.answer("Сначала введите данные")
        return

    if "diameter" not in data or "field" not in data:
        await callback.message.answer("Не хватает данных")
        return

    diameter = data["diameter"]
    field = data["field"]

    result = find_tolerance(diameter, field)

    if not result:
        await callback.message.answer("Нет данных в таблице")
        return

    low, high = result

    min_size = diameter + low / 1000
    max_size = diameter + high / 1000

    answer = (
        f"Диаметр: {diameter} мм"
        f"Допуск: {field}"
        f"Верхнее отклонение: {low} мкм"
        f"Нижнее отклонение: {high} мкм"
        f"Максимальный размер: {min_size:.3f} мм"
        f"Минимальный размер: {max_size:.3f} мм"
    )

    await callback.message.answer(answer)
    await callback.answer()


@dp.message()
async def messages(message: Message):
    data = user_data.get(message.from_user.id)

    if not data:
        return

    if data.get("mode") == "wait_diameter":
        try:
            diameter = float(message.text.replace(',', '.'))

            user_data[message.from_user.id]["diameter"] = diameter
            user_data[message.from_user.id]["mode"] = "done"

            await message.answer(
                f"Диаметр сохранён: {diameter} мм",
                reply_markup=main_keyboard()
            )

        except:
            await message.answer("Ошибка ввода")


async def main():
    await dp.start_polling(bot)


if __name__ == "__main__":
    asyncio.run(main())